modm-ext/archive-stmicro-svd/rm_rm0316_stm32f303rdt6.svd
      <register>
        <name>RDH0R</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATA4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA5</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA6</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA7</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RI1R</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RTR</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>IDE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EXID</name>
            <bitOffset>3</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>STID/EXID</name>
            <bitOffset>21</bitOffset>
            <bitWidth>11</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RDT1R</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DLC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>FMI</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>TIME</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RDL1R</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATA0</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA2</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA3</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>RDH1R</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DATA4</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA5</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA6</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DATA7</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FMR</name>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FINIT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>1</bitOffset>
            <bitWidth>31</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FM1R</name>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FBM</name>
            <bitOffset>0</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FS1R</name>
        <addressOffset>0x20c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FSC</name>
            <bitOffset>0</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FFA1R</name>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FFA</name>
            <bitOffset>0</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>FA1R</name>
        <addressOffset>0x21c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FACT</name>
            <bitOffset>0</bitOffset>
            <bitWidth>14</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F0R1</name>
        <addressOffset>0x240</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F0R2</name>
        <addressOffset>0x244</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F1R1</name>
        <addressOffset>0x248</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F1R2</name>
        <addressOffset>0x24c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F27R1</name>
        <addressOffset>0x318</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>F27R2</name>
        <addressOffset>0x31c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>FB</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x40007000</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>LPDS</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PDDS</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CWUF</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>CSBF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PVDE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PLS</name>
            <bitOffset>5</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>DBP</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>9</bitOffset>
            <bitWidth>23</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>CSR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>WUF</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBF</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PVDO</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>VREFINTRDYF</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>4</bitOffset>
            <bitWidth>28</bitWidth>
          </field>
          <field>
            <name>EWUP1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EWUP2</name>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>EWUP3</name>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>DAC1</name>
      <baseAddress>0x40007400</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>EN1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOFF1</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEN1</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSEL1</name>
            <bitOffset>3</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WAVE1</name>
            <bitOffset>6</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MAMP1</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DMAEN1</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAUDRIE1</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>14</bitOffset>
            <bitWidth>18</bitWidth>
          </field>
          <field>
            <name>EN2</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>BOFF2</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TEN2</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TSEL2</name>
            <bitOffset>19</bitOffset>
            <bitWidth>3</bitWidth>
          </field>
          <field>
            <name>WAVE2</name>
            <bitOffset>22</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
          <field>
            <name>MAMP2</name>
            <bitOffset>24</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DMAEN2</name>
            <bitOffset>28</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAUDRIE2</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SWTRIGR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>SWTRIG1</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SWTRIG2</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>2</bitOffset>
            <bitWidth>30</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12R1</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12L1</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR8R1</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12R2</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12L2</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR8R2</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>8</bitOffset>
            <bitWidth>24</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12RD</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>16</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR12LD</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>4</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>20</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DHR8RD</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC1DHR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>DACC2DHR</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DOR1</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC1DOR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>DOR2</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>DACC2DOR</name>
            <bitOffset>0</bitOffset>
            <bitWidth>12</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>12</bitOffset>
            <bitWidth>20</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>SR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>s</name>
            <bitOffset>0</bitOffset>
            <bitWidth>32</bitWidth>
          </field>
          <field>
            <name>DMAUDR1</name>
            <bitOffset>13</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DMAUDR2</name>
            <bitOffset>29</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
    <peripheral>
      <name>I2C3</name>
      <baseAddress>0x40007800</baseAddress>
      <register>
        <name>CR1</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>PE</name>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TXIE</name>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXIE</name>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ADDRIE</name>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NACKIE</name>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>STOPIE</name>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>TCIE</name>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ERRIE</name>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>DNF</name>
            <bitOffset>8</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ANFOFF</name>
            <bitOffset>12</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>13</bitOffset>
            <bitWidth>19</bitWidth>
          </field>
          <field>
            <name>TXDMAEN</name>
            <bitOffset>14</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>RXDMAEN</name>
            <bitOffset>15</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SBC</name>
            <bitOffset>16</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>NOSTRETCH</name>
            <bitOffset>17</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>WUPEN</name>
            <bitOffset>18</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>GCEN</name>
            <bitOffset>19</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBHEN</name>
            <bitOffset>20</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>SMBDEN</name>
            <bitOffset>21</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>ALERTEN</name>
            <bitOffset>22</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>PECEN</name>
            <bitOffset>23</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
