modm-ext/archive-stmicro-svd/rm_rm0316_stm32f303rdt6.svd
      <register>
        <name>PIO4</name>
        <addressOffset>0xb0</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>IOSETx</name>
            <bitOffset>0</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>IOWAITx</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>IOHOLDx</name>
            <bitOffset>16</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>IOHIZx</name>
            <bitOffset>24</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BWTR1</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADDSET</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDHLD</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATAST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>ACCMOD</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BWTR2</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADDSET</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDHLD</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATAST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>ACCMOD</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BWTR3</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADDSET</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDHLD</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATAST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>ACCMOD</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>BWTR4</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
        <fields>
          <field>
            <name>ADDSET</name>
            <bitOffset>0</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>ADDHLD</name>
            <bitOffset>4</bitOffset>
            <bitWidth>4</bitWidth>
          </field>
          <field>
            <name>DATAST</name>
            <bitOffset>8</bitOffset>
            <bitWidth>8</bitWidth>
          </field>
          <field>
            <name>s</name>
            <bitOffset>16</bitOffset>
            <bitWidth>16</bitWidth>
          </field>
          <field>
            <name>ACCMOD</name>
            <bitOffset>28</bitOffset>
            <bitWidth>2</bitWidth>
          </field>
        </fields>
      </register>
    </peripheral>
  </peripherals>
</device>
